benchbnb/app/controllers/api/benches_controller.rb

SELECT "benches".* FROM "benches"
---
    def index
        @benches = Bench.all

INSERT INTO "benches" ("description", "lat", "lng", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "This is another bench!"], ["lat", 37.759699], ["lng", -122.429188], ["created_at", "2018-12-10 21:39:20.658385"], ["updated_at", "2018-12-10 21:39:20.658385"]]
---
    def create
        @bench = Bench.new(bench_params)

        if @bench.save